删除 从 教师     --清空教师表

删除 从 课程     --清空课程表

删除 从 学生     --清空学生表

删除 从 选修     --清空选修表

--插入教师表测试数据
插入 到 教师(教师号,教师名,职称)
    值表 ('T1','陈','教授'),
         ('T2','朱','教授'),
         ('T3','孙','讲师'),
         ('T4','刘','讲师')

--插入课程表测试数据
插入 到 课程(课程号,课程名,教师号)
    值表 ('C1','数据库','T1'),
         ('C2','操作系统','T2'),
         ('C3','数据结构','T3'),
         ('C4','管理信息系统','T4')

--插入学生表测试数据
插入 到 学生(学生号,学生名,年龄,性别)
    值表 ('S1','包',20,'男'),
         ('S2','古',21,'男'),
         ('S3','安',22,'女'),
         ('S4','李',23,'男')

--插入选修表测试数据
插入 到 选修(选修号,学生号,课程号,分数)
    值表 ('SC1','S1','C1',93),
         ('SC2','S1','C2',85),
         ('SC3','S1','C3',93),
         ('SC4','S1','C4',74),
         ('SC5','S2','C1',93),
         ('SC6','S2','C2',89),
         ('SC7','S3','C3',95),
         ('SC8','S4','C4',70),
         ('SC9','S4','C2',71)
